{
    "coaches": [
        { "id": "coach1", "name": "Tim Bush", "title": "Director of Player Development", "bio": "Tim Bush joins the Divas organization in his first year, joining from TB Swift where he successfully placed 8 girls into NCAA scholarships last year. Prior to TB Swift, Bush spent many years with Cy-Fair at the 17U Level. During his playing career, Tim graduated from Baylor University, played professionally for the Spurs and Thunder organizations, and abroad including China. Tim will be handling overall player development and strategy as well as directly focusing on the 16 and 17U elite teams in preparation for college scholarships.", "headshot": "/male_user.png" },
        { "id": "coach2", "name": "John Woods", "title": "Director of Grassroots Development", "bio": "John Woods has recently joined the organization from his own skills development organization JAWS. Woods is a staple in the Allen/McKinney area, growing up and playing youth club and  high school ball here in McKinney, and going on to play for the University of Missouri. Woods has personally developed multiple DFW area kids in both football and basketball, and has a heart for service. Woods will be responsible for grassroots development and focus on the 14-16U elite and competitive teams.", "headshot": "/male_user.png" },
        { "id": "coach3", "name": "Bruce Davison, Jr.", "title": "Head Coach Middle School Girls - 8th Grade", "bio": "Bruce Davison Jr. returns to the sideline for his second year of coaching with the Divas. Davison has volunteered for many years in the Allen area for boys and girls teams that were transitioning from recreation ball into tournament style teams. Bruce holds a degree from University of Texas – El Paso, and credits his passion for coaching and doing things the right way to his father Bruce Davison Sr, who was a First Sgt in the US Army.", "headshot": "/male_user.png" },
        { "id": "coach4", "name": "Chris O'Mara", "title": "Head Coach Middle School Girls - 7th Grade", "bio": "Chris O’Mara joins the Divas after spending the past 6 years coaching the Mystics in the Allen recreational leagues. O’Mara is an excellent recruiter and eye for talent, and has been developing and coaching several of the middle school players for multiple years. O’Mara brings a Detroit style work ethic to coaching and holds a degree from Central Michigan University.", "headshot": "/male_user.png" },
        { "id": "coach5", "name": "Payton Hicks", "title": "Assistant Coach – Grassroots", "bio": "Payton Hicks will be returning for her second year with the Divas organization after completing her senior year at the University of Mary Hardin Baylor. Hicks currently is the starting point guard on a deep UMHB team and is best known for connecting with the girls as she completes her playing journey. Each practice Coach Hicks runs will be authentic to the current women’s basketball experience and her passion for girls’ development is evident.", "headshot": "/female_user.png" },
        { "id": "coach6", "name": "Anna Carroll", "title": "Head Coach Youth Girls – 4th Grade", "bio": "Anna Carroll has been named the 4th grade head coach taking the reins over her father Mark Carroll. Anna has been working with the 4th graders for 3 years now, and wants to pursue a career in coaching long term. Anna is currently completing her freshman year of high school at Allen where she is a starter for the Freshman A team. Anna will also compete this year in the high school divisions of multiple summer tournaments. ", "headshot": "/female_user.png" }
    ]
}